; domain
;; Enrico Scala (enricos83@gmail.com)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; counters-ineq-rnd domain, functional strips version
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; This domain describes a set of counters that can be increased and decreased. The rate of such counter is however variable!

(define (domain fo-counters-rnd)
    (:requirements :strips :typing :fluents :adl)
    (:types counter)

    (:functions
        (value ?c - counter);; - int  ;; The value shown in counter ?c
        (rate_value ?c - counter);;
        (max_int);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action increment
         :parameters (?c - counter)
         :precondition (and (<= (+ (value ?c) (rate_value ?c)) (max_int)))
         :effect (and (increase (value ?c) (rate_value ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action decrement
         :parameters (?c - counter)
         :precondition (and (>= (- (value ?c) (rate_value ?c)) 0))
         :effect (and (decrease (value ?c) (rate_value ?c)))
    )

    (:action increase_rate
         :parameters (?c - counter)
         :precondition (and (<= (+ (rate_value ?c) 1) 10))
         :effect (and (increase (rate_value ?c) 1))
    )

    (:action decrement_rate
         :parameters (?c - counter)
         :precondition (and (>= (rate_value ?c) 1))
         :effect (and (decrease (rate_value ?c) 1))
    )


)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_9_100)
	(:domain fo-counters-rnd)
	(:objects
		c0 c1 c2 c3 c4 c5 c6 c7 c8 - counter
	)
  (:init
		(= (value c0) 77)
	(= (value c1) 49)
	(= (value c2) 79)
	(= (value c3) 70)
	(= (value c4) 79)
	(= (value c5) 42)
	(= (value c6) 26)
	(= (value c7) 61)
	(= (value c8) 9)

        (= (rate_value c0) 0)
	(= (rate_value c1) 0)
	(= (rate_value c2) 0)
	(= (rate_value c3) 0)
	(= (rate_value c4) 0)
	(= (rate_value c5) 0)
	(= (rate_value c6) 0)
	(= (rate_value c7) 0)
	(= (rate_value c8) 0)

		(= (max_int) 100)
	)
	(:goal
		(and
			(<= (+ (value c0) 1) (value c1))
	(<= (+ (value c1) 1) (value c2))
	(<= (+ (value c2) 1) (value c3))
	(<= (+ (value c3) 1) (value c4))
	(<= (+ (value c4) 1) (value c5))
	(<= (+ (value c5) 1) (value c6))
	(<= (+ (value c6) 1) (value c7))
	(<= (+ (value c7) 1) (value c8))
		)
	)
)

; plan
1. (increase_rate c8)
   changed: (rate_value c8) from 0 to 1
   goals met: 3 of 8
2. (increase_rate c8)
   changed: (rate_value c8) from 1 to 2
   goals met: 3 of 8
3. (increase_rate c8)
   changed: (rate_value c8) from 2 to 3
   goals met: 3 of 8
4. (increase_rate c8)
   changed: (rate_value c8) from 3 to 4
   goals met: 3 of 8
5. (increase_rate c8)
   changed: (rate_value c8) from 4 to 5
   goals met: 3 of 8
6. (increase_rate c8)
   changed: (rate_value c8) from 5 to 6
   goals met: 3 of 8
7. (increase_rate c3)
   changed: (rate_value c3) from 0 to 1
   goals met: 3 of 8
8. (increase_rate c3)
   changed: (rate_value c3) from 1 to 2
   goals met: 3 of 8
9. (increase_rate c5)
   changed: (rate_value c5) from 0 to 1
   goals met: 3 of 8
10. (increase_rate c5)
   changed: (rate_value c5) from 1 to 2
   goals met: 3 of 8
11. (increase_rate c6)
   changed: (rate_value c6) from 0 to 1
   goals met: 3 of 8
12. (increase_rate c6)
   changed: (rate_value c6) from 1 to 2
   goals met: 3 of 8
13. (increase_rate c5)
   changed: (rate_value c5) from 2 to 3
   goals met: 3 of 8
14. (increase_rate c5)
   changed: (rate_value c5) from 3 to 4
   goals met: 3 of 8
15. (decrement c5)
   changed: (value c5) from 42 to 38
   goals met: 3 of 8
16. (increase_rate c3)
   changed: (rate_value c3) from 2 to 3
   goals met: 3 of 8
17. (increase_rate c3)
   changed: (rate_value c3) from 3 to 4
   goals met: 3 of 8
18. (increase_rate c3)
   changed: (rate_value c3) from 4 to 5
   goals met: 3 of 8
19. (increment c3)
   changed: (value c3) from 70 to 75
   goals met: 3 of 8
20. (increase_rate c8)
   changed: (rate_value c8) from 6 to 7
   goals met: 3 of 8
21. (increase_rate c8)
   changed: (rate_value c8) from 7 to 8
   goals met: 3 of 8
22. (increment c8)
   changed: (value c8) from 9 to 17
   goals met: 3 of 8
23. (increment c8)
   changed: (value c8) from 17 to 25
   goals met: 3 of 8
24. (increment c8)
   changed: (value c8) from 25 to 33
   goals met: 3 of 8
25. (increase_rate c8)
   changed: (rate_value c8) from 8 to 9
   goals met: 3 of 8
26. (increment c8)
   changed: (value c8) from 33 to 42
   goals met: 3 of 8
27. (increase_rate c8)
   changed: (rate_value c8) from 9 to 10
   goals met: 3 of 8
28. (increment c8)
   changed: (value c8) from 42 to 52
   goals met: 3 of 8
29. (increment c8)
   changed: (value c8) from 52 to 62
   goals met: 4 of 8
30. (increase_rate c6)
   changed: (rate_value c6) from 2 to 3
   goals met: 4 of 8
31. (increase_rate c5)
   changed: (rate_value c5) from 4 to 5
   goals met: 4 of 8
32. (decrement c5)
   changed: (value c5) from 38 to 33
   goals met: 4 of 8
33. (increase_rate c5)
   changed: (rate_value c5) from 5 to 6
   goals met: 4 of 8
34. (increase_rate c5)
   changed: (rate_value c5) from 6 to 7
   goals met: 4 of 8
35. (increase_rate c5)
   changed: (rate_value c5) from 7 to 8
   goals met: 4 of 8
36. (increment c5)
   changed: (value c5) from 33 to 41
   goals met: 4 of 8
37. (increment c5)
   changed: (value c5) from 41 to 49
   goals met: 4 of 8
38. (increase_rate c4)
   changed: (rate_value c4) from 0 to 1
   goals met: 4 of 8
39. (increase_rate c4)
   changed: (rate_value c4) from 1 to 2
   goals met: 4 of 8
40. (increment c3)
   changed: (value c3) from 75 to 80
   goals met: 4 of 8
41. (increment c4)
   changed: (value c4) from 79 to 81
   goals met: 5 of 8
42. (increase_rate c6)
   changed: (rate_value c6) from 3 to 4
   goals met: 5 of 8
43. (increment c6)
   changed: (value c6) from 26 to 30
   goals met: 5 of 8
44. (increment c6)
   changed: (value c6) from 30 to 34
   goals met: 5 of 8
45. (increment c6)
   changed: (value c6) from 34 to 38
   goals met: 5 of 8
46. (increase_rate c5)
   changed: (rate_value c5) from 8 to 9
   goals met: 5 of 8
47. (increment c5)
   changed: (value c5) from 49 to 58
   goals met: 5 of 8
48. (increase_rate c5)
   changed: (rate_value c5) from 9 to 10
   goals met: 5 of 8
49. (increment c6)
   changed: (value c6) from 38 to 42
   goals met: 5 of 8
50. (increment c6)
   changed: (value c6) from 42 to 46
   goals met: 5 of 8
51. (increase_rate c1)
   changed: (rate_value c1) from 0 to 1
   goals met: 5 of 8
52. (increase_rate c1)
   changed: (rate_value c1) from 1 to 2
   goals met: 5 of 8
53. (increase_rate c1)
   changed: (rate_value c1) from 2 to 3
   goals met: 5 of 8
54. (increase_rate c1)
   changed: (rate_value c1) from 3 to 4
   goals met: 5 of 8
55. (increase_rate c1)
   changed: (rate_value c1) from 4 to 5
   goals met: 5 of 8
56. (increase_rate c1)
   changed: (rate_value c1) from 5 to 6
   goals met: 5 of 8
57. (increment c1)
   changed: (value c1) from 49 to 55
   goals met: 5 of 8
58. (increase_rate c1)
   changed: (rate_value c1) from 6 to 7
   goals met: 5 of 8
59. (increment c1)
   changed: (value c1) from 55 to 62
   goals met: 5 of 8
60. (increase_rate c1)
   changed: (rate_value c1) from 7 to 8
   goals met: 5 of 8
61. (increment c1)
   changed: (value c1) from 62 to 70
   goals met: 5 of 8
62. (increment c1)
   changed: (value c1) from 70 to 78
   goals met: 6 of 8
63. (increment c6)
   changed: (value c6) from 46 to 50
   goals met: 6 of 8
64. (increment c6)
   changed: (value c6) from 50 to 54
   goals met: 6 of 8
65. (increment c6)
   changed: (value c6) from 54 to 58
   goals met: 6 of 8
66. (increment c6)
   changed: (value c6) from 58 to 62
   goals met: 6 of 8
67. (increase_rate c4)
   changed: (rate_value c4) from 2 to 3
   goals met: 6 of 8
68. (increase_rate c4)
   changed: (rate_value c4) from 3 to 4
   goals met: 6 of 8
69. (increment c5)
   changed: (value c5) from 58 to 68
   goals met: 5 of 8
70. (increment c6)
   changed: (value c6) from 62 to 66
   goals met: 5 of 8
71. (increment c6)
   changed: (value c6) from 66 to 70
   goals met: 6 of 8
72. (increase_rate c6)
   changed: (rate_value c6) from 4 to 5
   goals met: 6 of 8
73. (increase_rate c6)
   changed: (rate_value c6) from 5 to 6
   goals met: 6 of 8
74. (increase_rate c6)
   changed: (rate_value c6) from 6 to 7
   goals met: 6 of 8
75. (increase_rate c6)
   changed: (rate_value c6) from 7 to 8
   goals met: 6 of 8
76. (increase_rate c6)
   changed: (rate_value c6) from 8 to 9
   goals met: 6 of 8
77. (increase_rate c6)
   changed: (rate_value c6) from 9 to 10
   goals met: 6 of 8
78. (increment c5)
   changed: (value c5) from 68 to 78
   goals met: 5 of 8
79. (increment c6)
   changed: (value c6) from 70 to 80
   goals met: 6 of 8
80. (increase_rate c7)
   changed: (rate_value c7) from 0 to 1
   goals met: 6 of 8
81. (increase_rate c7)
   changed: (rate_value c7) from 1 to 2
   goals met: 6 of 8
82. (increase_rate c7)
   changed: (rate_value c7) from 2 to 3
   goals met: 6 of 8
83. (increase_rate c7)
   changed: (rate_value c7) from 3 to 4
   goals met: 6 of 8
84. (increase_rate c7)
   changed: (rate_value c7) from 4 to 5
   goals met: 6 of 8
85. (increment c7)
   changed: (value c7) from 61 to 66
   goals met: 5 of 8
86. (increment c8)
   changed: (value c8) from 62 to 72
   goals met: 6 of 8
87. (increment c7)
   changed: (value c7) from 66 to 71
   goals met: 6 of 8
88. (increment c5)
   changed: (value c5) from 78 to 88
   goals met: 6 of 8
89. (increment c7)
   changed: (value c7) from 71 to 76
   goals met: 5 of 8
90. (increment c8)
   changed: (value c8) from 72 to 82
   goals met: 6 of 8
91. (increment c7)
   changed: (value c7) from 76 to 81
   goals met: 7 of 8
92. (increment c6)
   changed: (value c6) from 80 to 90
   goals met: 7 of 8
93. (increment c7)
   changed: (value c7) from 81 to 86
   goals met: 6 of 8
94. (increment c8)
   changed: (value c8) from 82 to 92
   goals met: 7 of 8
95. (increment c7)
   changed: (value c7) from 86 to 91
   goals met: 8 of 8
